BrentIO/FireFly-Controller/Hardware-Registration-and-Configuration/boards.txt
firefly_controller.name=P5 Software FireFly Controller

firefly_controller.bootloader.tool=esptool_py
firefly_controller.bootloader.tool.default=esptool_py

firefly_controller.upload.tool=esptool_py
firefly_controller.upload.tool.default=esptool_py
firefly_controller.upload.tool.network=esp_ota

firefly_controller.upload.maximum_size=1310720
firefly_controller.upload.maximum_data_size=327680
firefly_controller.upload.wait_for_upload_port=true
firefly_controller.upload.flags=
firefly_controller.upload.extra_flags=

firefly_controller.serial.disableDTR=true
firefly_controller.serial.disableRTS=true

firefly_controller.build.tarch=xtensa
firefly_controller.build.bootloader_addr=0x1000
firefly_controller.build.target=esp32
firefly_controller.build.mcu=esp32
firefly_controller.build.core=esp32
firefly_controller.build.variant=esp32
firefly_controller.build.board=ESP32_DEV

firefly_controller.build.f_cpu=240000000L
firefly_controller.build.flash_mode=dio
firefly_controller.build.flash_size=16MB
firefly_controller.build.boot=dio
firefly_controller.build.partitions=default
firefly_controller.build.defines=

firefly_controller.menu.FlashFreq.80=80MHz
firefly_controller.menu.FlashFreq.80.build.flash_freq=80m
firefly_controller.menu.FlashFreq.40=40MHz
firefly_controller.menu.FlashFreq.40.build.flash_freq=40m

firefly_controller.menu.PartitionScheme.default=Default (6.25MB APP/OTA/3.43MB SPIFFS)
firefly_controller.menu.PartitionScheme.default.build.partitions=default_16MB
firefly_controller.menu.PartitionScheme.default.upload.maximum_size=6553600

firefly_controller.menu.UploadSpeed.921600=921600
firefly_controller.menu.UploadSpeed.921600.upload.speed=921600
firefly_controller.menu.UploadSpeed.115200=115200
firefly_controller.menu.UploadSpeed.115200.upload.speed=115200
firefly_controller.menu.UploadSpeed.256000.windows=256000
firefly_controller.menu.UploadSpeed.256000.upload.speed=256000
firefly_controller.menu.UploadSpeed.230400.windows.upload.speed=256000
firefly_controller.menu.UploadSpeed.230400=230400
firefly_controller.menu.UploadSpeed.230400.upload.speed=230400
firefly_controller.menu.UploadSpeed.460800.linux=460800
firefly_controller.menu.UploadSpeed.460800.macosx=460800
firefly_controller.menu.UploadSpeed.460800.upload.speed=460800
firefly_controller.menu.UploadSpeed.512000.windows=512000
firefly_controller.menu.UploadSpeed.512000.upload.speed=512000

firefly_controller.menu.DebugLevel.none=None
firefly_controller.menu.DebugLevel.none.build.code_debug=0
firefly_controller.menu.DebugLevel.error=Error
firefly_controller.menu.DebugLevel.error.build.code_debug=1
firefly_controller.menu.DebugLevel.warn=Warn
firefly_controller.menu.DebugLevel.warn.build.code_debug=2
firefly_controller.menu.DebugLevel.info=Info
firefly_controller.menu.DebugLevel.info.build.code_debug=3
firefly_controller.menu.DebugLevel.debug=Debug
firefly_controller.menu.DebugLevel.debug.build.code_debug=4
firefly_controller.menu.DebugLevel.verbose=Verbose
firefly_controller.menu.DebugLevel.verbose.build.code_debug=5

firefly_controller.menu.EraseFlash.none=Disabled
firefly_controller.menu.EraseFlash.none.upload.erase_cmd=
firefly_controller.menu.EraseFlash.all=Enabled
firefly_controller.menu.EraseFlash.all.upload.erase_cmd=-e

##############################################################